Revit 2027 API
View3D.HasBeenLocked Method
 Identifies if the view has ever been locked.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasBeenLocked()
Public Function HasBeenLocked As Boolean
public:
bool HasBeenLocked()
member HasBeenLocked : unit -> bool
Return Value
Boolean
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace